# 入职培训

## 常见命令

```
show run int vlan 100  # 查看vlan 100的信息
show ip int brief      # 查看端口的ip信息简介
show ip dhcpd binding  # 查看dhcp分配的ip地址 
```

```bash
show running-config | section rip # 查看有关rip的配置命令信息
show ip route rip
clear ip route * # 清理路由表
```



### 生成树配置命令

```cmd
# 启用关闭生成树（交换机默认开启）
Switch_config#no spanning-tree 
Switch_config#spanning-tree

# 修改生成树的协议的类型
Switch_config#spanning-tree mode rstp
#设置网桥优先级（一般将核心交换机设置为根网桥）
Switch_config#spanning-tree rstp priority bridge-priority
# 为接口配置优先级（一般不用改动）
Switch_config_f0/6#spanning-tree rstp port-priority port-priority
# 生成树状态查看
Switch#show spanning-tree [detail]
```

### ACL访问控制列表命令

```cmd
# 开启ip_acl拓展   源目ip,源目端口
ip access-list extended ip-acl     
# 允许10.1.0.0到10.1.2.20端口为80web应用
Permit tcp 10.1.0.0 255.255.255.0  10.1.2.20 255.255.255.0 eq 80
Permit tcp 10.1.1.1 255.255.255.255 eq 21 any eq 21
Deny tcp 10.1.1.0  255.255.255.0   10.1.2.21 255.255.255.255 eq 1521
permit ip src_range 10.1.1.2 10.1.1.50 any
permit ip  10.1.1.1 255.255.255.0 dst_range 10.2.1.1 10.2.1.250
Deny ip 10.1.0.0 0.0.255.255 any
deny any any //默认有但不显示

# 开启mac-acl  
# 无分类，作用在二层接口 in 方向
mac access-list mac_acl1
permit host 1234.5678.abcd any 0x806
deny any any //默认有但不显示

mac access-list mac_acl2
permit  98-5F-D3-3A-83-E3   FF-FF-FF-FF-FF-FF  any
Int f0/1  
Mac access-group acl1 in

```

```
#ip acl标准     源ip
ip access-list standard acl1
Deny  192.168.1.0 255.255.255.0
Permit any
Int g0/1  
ip access-group acl1 in
```

```
# 3. ip ACL 拓展
Time-range time
             periodic weekdays 00:00 to 08:00            
             periodic weekdays 11:00 to 23:59

ip access-list extended acl3
Deny  ip 192.168.1.0 255.255.255.0  any  time-range time

Int g0/1  
ip access-group acl3 in

# 2. 采用ip acl 实现从192.168.1.0网段到外网的业务进行地址转换
ip access-list extended acl4
permit ip 192.168.1.0 255.255.255.0 any
ip nat inside source list acl4 int g0/0
int g0/1
ip nat inside
int g0/0
ip nat outside
```

<img src="入职培训.assets/截屏2024-07-14 23.33.29.png" alt="截屏2024-07-14 23.33.29" style="zoom:50%;" />



### 路由设置

```
# 直连路由，创建三层接口即可实现。

# 默认路由  数值越小越优先
ip route default g0/1 {5}  
# 静态路由，手动指定
ip route 192.168.10.0 255.255.255.0 10.0.0.1
```

### DHCP

```
sw1_config#ip dhcpd enable
sw1_config#ip dhcpd pool 999
sw1_config_dhcp#network 192.168.100.0 255.255.255.0   # 设置网段 子网掩码
sw1_config_dhcp#range 192.168.100.1 192.168.100.254 
sw1_config_dhcp#default-router 192.168.100.254
sw1_config_dhcp#dns-server 8.8.8.8
```

> 路由器三层接口自动获取地址

```
sw1_config#int g0/1
sw1_config_g0/1#ip address dhcp        #将端口设置为DHCP客户端，ip地址由对方指定
# 路由器三层接口自动获取地址 进入指定接口， 输入 ip address dhcp自动获取ip地址
```

```
#通过option43将AC地址告诉AP，使得AP可以注册到AC上
sw1_config_dhcp#specific-information hex (AC ip地址的16进制)
```



## 基础知识

### 网关

网关就是一个关口，若目标ip地址<font color = 'red'>**与当前ip地址在同一网段**</font>，不需要经过网关，否则需要。

```
192.168.20.254
```



### 私网、公网

- 私网和公网（Internet，公网是世界上最大的互联网）又称为内网和外网。

- 私有IP是Internet保留给私人网络的IP

| 类型 |           私有IP            |
| :--: | :-------------------------: |
|  A   |   10.0.0.0~10.255.255.255   |
|  B   |  172.16.0.0~172.31.255.255  |
|  C   | 192.168.0.0~192.168.255.255 |

#### ip和mac地址

IP属于网络层。用于主机与主机之间的通信，点对点通信。



MAC地址（网络层）：用于**两个直连设备**之间的通信。

IP地址（数据链路层）：负责在**【没有直连】**的**两个网络**之间进行通信传输。



在整个通信阶段：源IP地址和目的IP地址是**不会变化的**（假设没有NAT网络），而源MAC地址和目的MAC地址会**一直变化**。



IP地址会根据网卡来配置的，而不是主机台数。像服务器和路由器都会有2个以上网卡，即会有2个以上IP地址。



#### IP分类

1. 不同分类的IP地址范围

   | 类型 |        IP地址范围         |
   | :--: | :-----------------------: |
   |  A   |  0.0.0.0~127.255.255.255  |
   |  B   | 128.0.0.0~191.255.255.255 |
   |  C   | 192.0.0.0~223.255.255.255 |
   |  D   | 224.0.0.0~239.255.255.255 |



#### 2. 最大主机个数

最大主机个数：

如C类地址的： 2^8-2 = 254（除去全为0和1的主机号）             

- 主机号全为1用来指定某个网络下的所有主机：**用于广播**      如  10.100.122.255（255.255.255.0）
- 主机号全为0指定某个网络   **表示网络号**     如  10.100.122.0（255.255.255.0）

> 广播地址就是用于在同一条链路中互连的主机之间发送数据包。
>
> 分为两种：本地广播、直接广播
>
> - 本地广播：在本网络内广播，如192.168.0.0/24的广播地址是192.168.0.255。这个广播地址的IP包会被路由器屏蔽，所以达不到192.168.0.0/24以外的其他链路上。
> - 直接广播（不安全，一般路由器设置为不转发）：在不同网络间进行广播，如192.168.0.0/24的主机向192.168.1.255/24的目标地址发送IP包。收到这个数据包的路由器会将数据转发给192.168.1.0/24，从而使得所有192.168.1.1~192.168.1.254 的主机都能收到这个包



#### 3. D类和E类地址

D类和E类地址是没有主机号的，不可用于主机IP。

**D类用于多播**，E类是预留的分类。`1110`表示多播地址，剩下的28位是多播的组编号

> 多播用于将包发送给特定组内的所有主机。

<img src="C:/Users/85013/AppData/Roaming/Typora/typora-user-images/image-20240709223940792.png" alt="image-20240709223940792" style="zoom: 67%;" />



**注：广播无法穿透路由，若想给其他网段发送同样的数据包，可以使用穿透路由的多播。**

<img src="C:/Users/85013/AppData/Roaming/Typora/typora-user-images/image-20240709222518120.png" alt="image-20240709222518120" style="zoom:50%;" />

#### 4. IP分类的优点

当路由器或主机解析到一个IP地址时，可根据IP地址的首位，一步步判断是哪一个地址。

<img src="C:/Users/85013/AppData/Roaming/Typora/typora-user-images/image-20240709224126134.png" alt="image-20240709224126134" style="zoom:67%;" />

#### 5. 分离网络号和主机号的原因

因为主机间进行通信时，首先需要判断**是否两者的网络地址（网络号）是否相同**，若相同，则表示接收方在本网络上，可直接把数据包发送到目的主机。

同样的，路由寻址工作中，也是类似通过这种方式找到网络号的，进而把数据包转发给对应的网络内。

<img src="入职培训.assets/image-20240709230152211.png" alt="image-20240709230152211" style="zoom:67%;" />

#### 6. 子网的划分（通过子网掩码）

> 子网掩码一个作用：划分网络号和主机号
>
> 另一个作用：将主机地址划分为**子网网络地址**和**子网主机地址**。

<img src="入职培训.assets/image-20240709234724915.png" alt="image-20240709234724915" style="zoom:67%;" />





### 路由协议

#### 1.RIP

RIP（Routing Information Protocol）路由信息协议，是一种<font color = 'red'>**动态路由选择协议**</font>，是<font color = 'red'>**基于距离矢量算法**</font>。

使用<font color = 'red'>**"跳数"（最大15）**</font>来衡量达到目的地址的路由距离。

> 静态路由的问题：
>
> - 当网络拓扑结构和链路发生变化时，需要对路由器的静态路由信息进行大范围更改，复杂度高
> - 网络发生故障时，不能重选路由，很可能使路由失败。
>
> 而动态路由协议，让路由器自行学习，自适应网络的变化，无需人工更改配置。

<font color = 'red'>**适用于中小型网络，因为RIP是基于距离矢量的算法**</font>。由于它只支持0-15跳，第16跳会被标记为无限大或不可达。

所以在整个网络中最多只能有16个路由器相互成为rip邻居路由器，所以它只适用于中小型网络。



##### 工作原理

1. 路由器会向邻居节点宣告自己的路由。
2. 网络中的路由器从自己的邻居路由器得到路由信息，并将这些路由信息连同自己的本地路由信息发送给其他邻居
3. 这样一级级传递下去以达到全网同步
4. 每个路由器都不了解整个网络拓扑，它们只知道与自己直连的网络情况，并根据从邻居得到的路由信息更新自己的路由。





Wireshare抓包

Tracert探测工具  检测断在哪个链路



ARP《以太网基础》



ping

arp

ipconfig

route 《路由基础》



交换机：

```cmd
>> ping ?
>> chines

>> ena
>> show arp
>> show ip ro
# ip route 
>> ip route default 192.168.0.1
>> show ip interface brief
```

q停止

|      |                                                              |
| ---- | ------------------------------------------------------------ |
| -a   | 一直ping，直到被中断（Ping不通，出现“....."，否则是”!!!!...“） |
| -l   | 数据长度                                                     |
|      |                                                              |
|      |                                                              |
|      |                                                              |
|      |                                                              |
|      |                                                              |
|      |                                                              |
|      |                                                              |





网络三要素：终端、介质、网络设备

工作协议层划分：二层、三层交换机

以太网交换机主要应用场景：局域网内

交换机转发功能：(基于MAC地址表进行数据转发)

- 单播
- 组播
- 广播



两大功能：

1. 交换机对于收到的帧，学习其源MAC地址放入MAC地址表                   **学习功能**
2. 再根据收到的帧中间的目的MAC地址，查找MAC地址表进行转发：    **转发功能**

- 匹配，则从相应端口转发出去
- 不匹配，则泛洪（给MAC地址表上的每个终端都转发一份（不包括自己））



广播帧：洪泛        （广播风暴 =>  生成树）

组播：支持的转发给相应组员，不支持的洪范

```
二层交换机出现环路，断掉某一个线
```



ARP协议





VLAN 虚拟局域网

> 广播域：是广播帧所能传递到的范围，指能够直接通信的范围

分隔广播域



接的端口默认都是VLAN1

> 配置三层VLAN前需配置二层VLAN



VLAN作用：

- 实现端口逻辑上的隔离，增加网络安全



交换机端口类型：Access、Trunk、Hy



Access模式：交换机上用来连接用户主机的接口，它只能连接接入链路（Access Link）

- 接收报文
- 发送报文



Trunk模式：交换机上用来和其他交换机







# Day01

## 网络设备

### 1.交换机

<img src="入职培训.assets/截屏2024-07-10 22.58.53.png" alt="截屏2024-07-10 22.58.53" style="zoom: 50%;" />

二级网络设备，工作在数据链路层，主要**负责数据帧的转发和交换**，根据MAC转发数据帧，实现局域网内设备之间的通信。

实现<font color = 'red'>**多个终端**</font>在局域网内进行通信，如文件或数据的传输等。只需要将多台终端设备通过网线插到交换机上即可。若想要通过无线网进行局域网内的通信，需要通过无线AP来接收无线信号，AP再通过网线转发给交换机。



交换机内部会有一个MAC地址表，MAC地址表记录了每个PC（电脑）连接在交换机的哪个接口，**交换机可以根据mac地址进行数据转发**。

> PC在发送数据包时，需要给数据包指定目的MAC地址。
>
> ping 一个ip地址时，由于pc不知道目的ip地址，会通过arp请求，发送一个arp请求包，广播询问这个ip地址是谁的，目的主机收到请求后会回复arp响应，pc收到响应后就知道了目的主机的mac地址。
>
> 再发包，用单播。
>
> 完成arp解析，会把解析结果放在本机的arp缓存表中，下次请求可直接查表
>
> 指令：arp -a

![截屏2024-07-10 22.45.43](入职培训.assets/截屏2024-07-10 22.45.43.png)



#### MAC和IP地址

MAC地址：**电脑网卡的标识**，每个网卡都有一个mac地址（6字节）。其工作于数据链路层，用于唯一标识局域网内的设备，在局域网内是通过MAC地址来进行设备间的通信。

IP地址：工作于网络层，用于唯一标识不同网络中的设备，实现不同网络中设备之间的通信。









#### 交换机的分类

##### 不同分类

- 传输介质
- 是否支持网管功能
- 结构划分
- 传输速率

##### 工作的协议层划分

- 二层交换机
- 三层交换机

#### 

#### 交换机的功能

##### 1.转发功能

###### 单播



###### 组播

转发给相应的组员，不支持洪泛



###### 广播

广播帧，洪泛



##### 2.学习功能

交换机对收到的数据帧，学习其源MAC地址并存入至MAC地址表中。

<img src="入职培训.assets/截屏2024-07-10 23.12.23.png" alt="截屏2024-07-10 23.12.23" style="zoom:50%;" />

#### 三种转发方式

<img src="入职培训.assets/截屏2024-07-10 21.52.05.png" alt="截屏2024-07-10 21.52.05" style="zoom: 50%;" />

##### 泛洪 Flooding

<img src="入职培训.assets/截屏2024-07-10 21.53.16.png" alt="截屏2024-07-10 21.53.16" style="zoom:50%;" />

##### 转发 Forwarding

当数据帧的目的MAC地址出现在MAC地址表中，交换机会根据目的MAC地址将目的主机的信息单播转发给源主机。

<img src="入职培训.assets/截屏2024-07-10 21.54.35.png" alt="截屏2024-07-10 21.54.35" style="zoom:50%;" />

##### 丢弃 Discarding

如果说发送的数据帧的发送接口 = 接收接口，交换机会丢弃它。





#### 博达交换机基础操作

##### 1.建立连接

1. 开启CRT控制台，协议为Serial，端口（设备管理器 => 端口 => 通信端口 ），波特率9600，流控取消
2. 连接BDCOM交换机
   - 关闭无线网，防火墙

<img src="入职培训.assets/截屏2024-07-10 23.21.27.png" alt="截屏2024-07-10 23.21.27" style="zoom:33%;" />

##### 2.下载/上传文件（更新）

首先都需要打开Tftpd64软件，修改Server interfaces为当前主机的ip地址。

**从交换机下载：copy flash tftp**

**上传至交换机：copy tftp flash:**

后续的命令上传和下载都一样，远程服务端ip地址为当前主机的IP地址。

上传新的Switch.bin后，可通过**reboot命令**进行**交换机的版本升级**。

```
Switch#dir    # 查看交换机中的所有文件，如Switch.bin等等
Switch#config # 切入交换机配置
Switch_config#
```

<img src="入职培训.assets/截屏2024-07-10 23.25.02.png" alt="截屏2024-07-10 23.25.02" style="zoom:50%;" />

##### 3.忘记密码&回复出厂设置

<img src="入职培训.assets/截屏2024-07-10 23.32.14.png" alt="截屏2024-07-10 23.32.14" style="zoom: 50%;" />

### 2.路由器

**三级网络设备**，工作在**网络层**，负责IP数据包的转发和路由选择，会根据IP地址转发数据包，实现不同网络之间的通信

- 连接不同网段，实现<font color = 'red'>**在不同网段设备**</font>之间的通信。

- 实现地址转换，将私网IP地址转为公网IP地址。



### 3.防火墙

处于公网、内网之间。





## 虚拟局域网VLAN

### 1.概念

全称Virtual Local Area Network。  <font color = 'red'>**是一种交换技术**</font>

作用：**通过在交换机上进行VLAN的配置划分，来让最终用户实现访问分组、隔离等。**   `隔离广播域`

VLAN分配后的LAN可以是由少数几台电脑构成的网络，也可以是数以百计的电脑构成的企业网络。

VLAN所指的LAN特指使用**路由器分割的网络**——也就是广播域。



作用：

1，限制广播报文在整个网络中洪泛，控制广播风暴
2，**端口逻辑上隔离**，区分不同的网络，增加网络安全
3，产生虚拟组（vlan）管理不同部门网络，管理方便
4，通过配置不同的带宽给虚拟组（VLAN），增加带宽利用率



### 2.广播域

广播域：指广播帧所能传递到的范围，就是指能够直接通信的范围。

> 比如，几万人在同一个广播域中，只要一个人发一个数据包，所有人都能收到，会导致会占我们的带宽，消耗计算的CPU，其会对数据包进行处理

#### 常见的广播报文

##### ARP请求

广播询问目的ip地址终端的MAC地址

##### RIP路由协议

##### DHCP自动设置IP地址的协议

##### NetBEUI

Windows下使用的网络协议

##### IPX

Novell Netware使用的网络协议

##### Apple Talk

苹果公司计算机使用的网络协议



### 3.常用命令

```
#查看vlan信息#
Switch_config#show vlan brief 

#创建VLAN 10
Switch_config#vlan 10 

#给vlan 10起个名字，如果不起名字，会自动生成名字#
Switch_vlan10#name QQ 

Switch_vlan10#exit

#删除vlan 10#
Switch_config#no vlan 10 

#配置接口g0/1
Switch_config#interface g0/1
#将端口设置成access，这个是建议命令，不是必须的，这个命令提高接口安全性
Switch_config_g0/1#switchport mode access 
#把一个接口设置成access，并把接口划进vlan10   这和接口只收vlan10的数据包
Switch_config_g0/1#switchport access vlan 10 

#rang指定连续接口范围,对多个端口同时设置#
Switch_config#interface range g0/2-6 
```



### 4.不同用户划分网络

#### 步骤

以机要部门与访客网络为列实现VLAN的隔离。

- 研发网络使用交换机端口g0/1、g0/3、g0/4，并配置相同的VLAN100

- 市场网络使用端口g0/2、g0/6，并配置相同的VLAN200

- 访客使用端口g0/5，并配置VLAN300

- 同时在交换机上配置VLAN的限速，给vlan100 配置100M的带宽，vlan200 50M带宽，vlan300 30M带宽。

  > VLAN可用ID有4094个

<img src="入职培训.assets/截屏2024-07-10 23.45.51.png" alt="截屏2024-07-10 23.45.51" style="zoom:50%;" />

#### 操作

1. 为交换机创建多个vlan，名字可以相同，vlan号一定不相同
2. 给交换机的接口划分相应vlan      **多个交换机相同的vlan可以通信，不同的无法通信**

```
#全局创建VLAN
Interface vlan 100
Ip address 172.16.1.1 255.255.255.0
```

<img src="入职培训.assets/image-20240710235500834.png" alt="image-20240710235500834" style="zoom: 67%;" />

<img src="入职培训.assets/image-20240710235431444.png" alt="image-20240710235431444" style="zoom: 67%;" />



### 交换机端口类型

#### Access模式

接入模式，用来作为接入端口使用的模式。

交换机上用来连接用户主机的接口，它只能连接接入链路（Access Link），在存在VLAN的环境下，通常是连接电脑、打印机、服务器

```cmd
Switch_config#int g0/1
#该g0/1端口上发送的所有帧都将被打上该VLAN10的标记
Switch_config_g0/1#switchport mode access 
# 用于配置中继（trunk）端口时，指定哪些VLAN的流量可以通过该端口传输。
# 然而，由于端口已经被设置为访问模式（如上一步所示），这条命令在这里是不适用的，因为访问模式端口不支持VLAN中
# 继。如果端口是trunk模式，这条命令将允许VLAN 10的流量通过该端口。
Switch_config_g0/1#switchport trunk vlan-allowed 10 
Switch_config_g0/1#switchport trunk vlan-untagged 10
```

##### 接收报文

<img src="../Library/Application Support/typora-user-images/截屏2024-07-11 00.13.36.png" alt="截屏2024-07-11 00.13.36" style="zoom:50%;" />

```cmd
Switch_config#int g0/1
Switch_config_g0/1#switchport mode access
Switch_config_g0/1#switchport pvid 100
Switch_config_g0/1#show vlan interface g0/1

Interface            VLAN
Name                 Property PVID Vlan-Map         uTagg-Vlan-Map
-------------------- -------- ---- ---------------- ----------------
GigaEthernet0/1      Access   100  100              100
```

| 报文携带的Tag |                        处理方式                        |
| :-----------: | :----------------------------------------------------: |
|   vlan 100    |                          接收                          |
|     无TAG     | 打上g0/1接口的PVID并接收（不会查看vlan_map，直接接收） |
|   vlan 200    |                          丢弃                          |

##### 发送报文

<img src="入职培训.assets/截屏2024-07-11 00.17.45.png" alt="截屏2024-07-11 00.17.45" style="zoom:50%;" />

| 报文携带的TAG | g0/1处理方式  |
| :-----------: | :-----------: |
|   vlan 100    | 剥离TAG并转发 |
|   vlan 200    |     丢弃      |
|   vlan 300    |     丢弃      |

#### Trunk模式

**交换机上用来和其他交换机连接的接口**，它只能连接干道链路（Trunk Link）   <font color = 'red'>**连接另一台交换机的**</font>

```cmd
Switch_config#int g0/1
Switch_config_g0/1#switchport mode trunk 
```

##### 接收报文

<img src="入职培训.assets/截屏2024-07-11 00.21.39.png" alt="截屏2024-07-11 00.21.39" style="zoom: 50%;" />

```cmd
Switch_config#int g0/1
Switch_config_g0/1#switchport mode trunk
Switch_config_g0/1#switchport pvid 100
Switch_config_g0/1#show vlan int g0/1

Interface            VLAN
Name                 Property PVID Vlan-Map         uTagg-Vlan-Map
-------------------- -------- ---- ---------------- ----------------
GigaEthernet0/1      Trunk    100  1,100,200        100
```

| 报文携带的TAG |           g0/1处理方式           |
| :-----------: | :------------------------------: |
|   vlan 100    |        查看vlan-map并接收        |
|     无TAG     | 打上端口pvid，查看vlan-map并接收 |
|   vlan 300    |        查看vlan-map，丢弃        |



##### 发送报文

发送时首先查看数据帧标签Tag是否在vlan_map中

- 有则与当前端口的PVID（Port vlan id）进行比较：

  - 相同，则发送并剥离标签

  - 不同，则直接发送

- 无则丢弃该数据帧

<img src="入职培训.assets/截屏2024-07-11 00.26.58.png" alt="截屏2024-07-11 00.26.58" style="zoom:50%;" />

```cmd
Switch_config#int g0/1
Switch_config_g0/1#switchport mode trunk
Switch_config_g0/1#switchport pvid 100
Switch_config_g0/1#show vlan int g0/1

Interface            VLAN
Name                 Property PVID Vlan-Map         uTagg-Vlan-Map
-------------------- -------- ---- ---------------- ----------------
GigaEthernet0/1      Trunk    100  1,100,200        100
```

| 报文携带的TAG | 处理 => 先查看vlan-map，通过再查看uTagg-Vlan-Map |
| ------------- | ------------------------------------------------ |
| vlan 100      | 剥离标签，发送                                   |
| vlan 200      | 查看vlan-map，不在uTagg-Vlan-Map并发送           |
| vlan 300      | 查看vlan-map，丢弃                               |

#### 

#### Hybrid模式



#### 总结

|          | **接收数据**      |                   |                    | 发送数据          |                   |          |
| -------- | ----------------- | ----------------- | ------------------ | ----------------- | ----------------- | -------- |
| 端口类型 | TAG与端口VLAN相同 | TAG与端口VLAN不同 | 无TAG              | TAG与端口VLAN相同 | TAG与端口VLAN不同 | 无TAG    |
| Access   | 接收              | 不接收            | 接收打上端口VLAN   | 转发并删除TAG     | 不转发不处理      | 无此情况 |
| Trunk    | 接收不修改VLAN    | 接收不修改VLAN    | 接收并打上端口VLAN | 转发并删除TAG     | 转发不修改VLAN    | 无此情况 |





```
ip address 172.0.0.1 255.255.0.0
```



```
switch>> show vlan int g0/1 # 查看vlan的g0/1接口
switch>> enable
switch# dir
switch# quit # 退出原模式
```





# Day03

## 1.DHCP

DHCP（Dynamic Host Configuration Procotol）动态主机配置协议。  <font color = 'red'>**应用层协议**</font>

由DHCP服务器给主机动态分配`ip地址`、`子网掩码`、`网关地址`、`DNS服务器地址`



### 设计的主要目标

- 使TCP/IP网络的管理易于实现和维护
- 自动IP地址的分配和配置，用户无需手工配置
- 所有IP地址资源都由服务器统一存放、控制，集中IP子网的管理
- 对不使用的IP地址资源回收，提高利用率



### 优缺点

- 可避免手工设置所产生的错误
- 可避免多个用户使用相同IP地址而产生的冲突
- 无需网络管理员干涉，减少网络管理工作量
- 每个用户的IP地址是不固定的、随机性的，不利于管理和监控
- 服务器故障可能会导致全网瘫痪，需要在网内做相应的冗余备份，网络组建成本增加



### 系统组成

<img src="入职培训.assets/截屏2024-07-11 00.35.55.png" alt="截屏2024-07-11 00.35.55" style="zoom:50%;" />

#### DHCP服务器

能提供DHCP功能的服务器或具有DHCP功能的网络设备，下发DHCP地址池中的IP地址、网关、掩码、dns等信息。

#### DHCP Relay中继

一般为路由器或三层交换机等网络设备

```
由于客户端发送的DHCP Discover报文是个二层广播包（目的IP:0.0.0.0 目的MAC:ff.ff.ff.ff），若DHCP服务器与电脑处于不同网段，二层报文是不能穿过三层网络设备接口的，所以需要DHCP中继,将广播包打包为单播包，发送给DHCP服务器。
`DHCP服务器`要配置回城路由
```

<img src="入职培训.assets/截屏2024-07-14 11.34.03.png" alt="截屏2024-07-14 11.34.03" style="zoom: 50%;" />

打包为单播包：

<img src="入职培训.assets/截屏2024-07-14 11.35.04.png" alt="截屏2024-07-14 11.35.04" style="zoom:50%;" />

```
Router_config#interface g0/1
Router_config_g0/1#ip helper-address 192.168.1.10
```

<img src="入职培训.assets/截屏2024-07-14 23.07.57.png" alt="截屏2024-07-14 23.07.57" style="zoom:50%;" />



#### DHCP客户端

需要动态获得IP地址的主机



### DHCP协议报文

| **协议报文**                                                 | **报文方向**        | **作用**                                               | **报文类型** |
| ------------------------------------------------------------ | ------------------- | ------------------------------------------------------ | ------------ |
| **DHCP Discover**                                            | **Client到Server**  | **客户端发现服务器**                                   | **广播**     |
| **DHCP Offer**                                               | **Server到Client**  | **服务器对DHCP Discover报文的回应**                    | **广播**     |
| **DHCP Request**                                             | **Client到Server**  | **服务器选择及租期更新**                               | **广播**     |
| **DHCP Release**                                             | **Client到Server**  | **请求****释放已经获得的****IP****地址资源或取消租期** | **单播**     |
| **DHCP Ack/Nak**（申请的IP地址不在地址池范围，服务器会回拒绝的报文） | **Server到 Client** | **服务器对收到的请求报文的最终的确认**                 | **广播**     |
| **DHCP Decline**                                             | **Client到Server**  | **拒绝所获得的****IP****地址**                         | **广播**     |
| **DHCP Inform**                                              | **Client到Server**  | **向****DHCP****服务器****索要其他的配置参数**         | **单播**     |

![截屏2024-07-11 00.37.56](入职培训.assets/截屏2024-07-11 00.37.56.png)

1. 客户端发送DHCP Discover报文，来寻找和发现DHCP服务器。

   <img src="入职培训.assets/截屏2024-07-14 11.02.08.png" alt="截屏2024-07-14 11.02.08" style="zoom:25%;" />

   <img src="入职培训.assets/截屏2024-07-14 10.44.52.png" alt="截屏2024-07-14 10.44.52" style="zoom:25%;" />

   <img src="入职培训.assets/截屏2024-07-14 10.50.25.png" alt="截屏2024-07-14 10.50.25" style="zoom:25%;" />

> Transaction ID：客户端生成的随机数，用于唯一标识哪个客户端
>
> Bootp flags: (DHCP是基于Bootstrap Protocol发展出来的)，unicast服务器可以单播，不用广播
>
> Request List: 可能会是旧的Ip地址，表示想与DHCP服务器进行ip续租。
>
> Parameter Request List:客户端想要请求的信息在这里面进行设置。



2. DHCP服务器收到Discover报文后，会回复DHCP offer报文。

<img src="入职培训.assets/截屏2024-07-14 11.01.06.png" alt="截屏2024-07-14 11.01.06" style="zoom:25%;" />

<img src="入职培训.assets/截屏2024-07-14 10.53.24.png" alt="截屏2024-07-14 10.53.24" style="zoom:25%;" />

<img src="入职培训.assets/截屏2024-07-14 10.56.31.png" alt="截屏2024-07-14 10.56.31" style="zoom:25%;" />

> DHCP服务器分配给客户端的IP地址、子网掩码、租期、续租时间等等



3. 客服端收到DHCP服务器发来的配置信息后，发送DHCP request：（由于可能会存在多个DHCP服务器，所以这边的目的IP和MAC地址都是填广播地址，告诉他们我已经选择了具体哪个服务器的ip地址）

<img src="入职培训.assets/截屏2024-07-14 10.39.36.png" alt="截屏2024-07-14 10.39.36" style="zoom: 25%;" />

<img src="入职培训.assets/截屏2024-07-14 10.57.06.png" alt="截屏2024-07-14 10.57.06" style="zoom:25%;" />

> 客户端发送的Request报文，携带有自己选用的IP地址（多个DHCP可能会分配多个IP给他）



4. DHCP服务器收到了客户端的Request，回复DHCP ACK，确认新设备可以使用这个IP地址

   <img src="入职培训.assets/截屏2024-07-14 10.43.23.png" alt="截屏2024-07-14 10.43.23" style="zoom: 25%;" />





### DHCP配置

```cmd
sw1>ena
sw1#Jul 16 17:26:03 User admin enter privilege mode from console 0, level = 15
conf
sw1_config#vlan 100,200
Wait for LS processing...ok!
Creating VLAN(s),please wait...
OK!
sw1_config#show int br
Port   Description    Status    Vlan        Duplex   Speed    Type
g0/1                  down      1           auto     auto     Giga-Combo-FX    
g0/2                  down      1           auto     auto     Giga-Combo-FX    
g0/3                  up        1           full     1000Mb   Giga-Combo-TX    
g0/4                  down      1           auto     auto     Giga-Combo-FX    
g0/5                  down      1           auto     auto     Giga-TX          
g0/6                  down      1           auto     auto     Giga-TX          
g0/7                  down      1           auto     auto     Giga-TX          
g0/8                  down      1           auto     auto     Giga-TX          
g0/9                  down      1           auto     auto     Giga-TX          
g0/10                 down      1           auto     auto     Giga-TX          
g0/11                 down      1           auto     auto     Giga-TX          
g0/12                 down      1           auto     auto     Giga-TX          
g0/13                 down      1           auto     auto     Giga-TX          
g0/14                 down      1           auto     auto     Giga-TX          
g0/15                 down      1           auto     auto     Giga-TX          
g0/16                 down      1           auto     auto     Giga-TX          
g0/17                 down      1           auto     auto     Giga-TX          
g0/18                 down      1           auto     auto     Giga-TX          
g0/19                 down      1           auto     auto     Giga-TX          
g0/20                 down      1           auto     auto     Giga-TX          
g0/21                 down      1           auto     auto     Giga-TX          
g0/22                 down      1           auto     auto     Giga-TX          
sw1_config#int g0/3
sw1_config_g0/3#switchport pvid 100
sw1_config_g0/3#Jul 16 17:26:45 %LINEPROTO-5-UPDOWN: Line protocol on Interface VLAN100, changed state to up
Jul 16 17:26:46 %LINEPROTO-5-UPDOWN: Line protocol on Interface VLAN1, changed state to down

sw1_config_g0/3#quit
sw1_config#int vlan 100
sw1_config_v100#ip address 192.168.100.254 255.255.255.0
%err: IP network 192.168.100.0 overlaps with VLAN1
sw1_config_v100#show run no  
!version 2.2.0A build 28124
service timestamps log date
service timestamps debug date
!
hostname sw1
!
!
!
!
!
!
!
spanning-tree mode rstp
!
!
!
!
!
!
!
!
!
!
!         
!
aaa authentication login default local
aaa authentication enable default none
aaa authorization exec default local
!
username admin password 0 admin
!
!
!
!
!
!
!
vlan 1,100,200
!
!
no ip igmp-proxy enable
!
!
ip dhcpd pool 123
!
!
!         
!
!
!
!
!
!
!
!
ip exf
!
ipv6 exf
!
!
!
!
!
!
ip http server
!
!
!
!
!         
!
!
!Pending configurations for absent linecards:
!
!No configurations pending global
sw1_config_v100#show run int g0/3
Building configuration...

Current configuration:
!
interface GigaEthernet0/3
 switchport pvid 100
sw1_config_v100#show run int vlan 1
Building configuration...

Current configuration:
!
interface VLAN1
 ip address 192.168.0.1 255.255.0.0
 no ip directed-broadcast
sw1_config_v100#quit
sw1_config# int vlan 1   
sw1_config_v1#no ip address 
sw1_config_v1#quit
sw1_config#int vlan 100
sw1_config_v100#ip address 192.168.100.254 255.255.255.0
sw1_config_v100#quit
sw1_config#show run int vlan 100
Building configuration...

Current configuration:
!
interface VLAN100
 ip address 192.168.100.254 255.255.255.0
 no ip directed-broadcast
sw1_config#show ip int br
Interface                  IP-Address      Method Protocol-Status 
Null0                      unassigned      manual up  
VLAN1                      unassigned      manual down
VLAN100                    192.168.100.254 manual up  
sw1_config#ip dh
dhcp  dhcp-relay  dhcp-server  dhcpd  
sw1_config#ip dhcpd pool ?
  WORD       -- Address pool name
sw1_config#ip dhcpd pool 999
sw1_config_dhcp#ne
netbios-name-server  netbios-node-type  network  
sw1_config_dhcp#network ?
  A.B.C.D       -- Network number
sw1_config_dhcp#network 192.168.100.0 255.255.255.0
sw1_config_dhcp#range 192.168.100.1 192.168.100.254
sw1_config_dhcp#de
default  default-router  
sw1_config_dhcp#default-router 192.168.100.254
sw1_config_dhcp#dns-server 8.8.8.8
sw1_config_dhcp#quit

sw1_config#Jul 16 17:31:00 %LINE-5-UPDOWN: Line on Interface GigaEthernet0/3, changed state to down
Jul 16 17:31:00 %LINEPROTO-5-UPDOWN: Line protocol on Interface GigaEthernet0/3, changed state to down
Jul 16 17:31:01 %LINEPROTO-5-UPDOWN: Line protocol on Interface VLAN100, changed state to down
Jul 16 17:31:04 %LINE-5-UPDOWN: Line on Interface GigaEthernet0/3, changed state to up
Jul 16 17:31:04 %LINEPROTO-5-UPDOWN: Line protocol on Interface GigaEthernet0/3, changed state to up
Jul 16 17:31:07 %LINEPROTO-5-UPDOWN: Line protocol on Interface VLAN100, changed state to up

sw1_config#ip dhcpd enable 
sw1_config#show ip dhcpd ?
  binding         -- DHCP address bindings
  database-agent  -- DHCP Database Server
  pool            -- DHCP pools information
  statistic       -- DHCP server statistics
sw1_config#show ip dhcpd binding 

192.168.100.1     38-22-e2-1c-2a-81     automatic MON JUL 17 17:31:38 2023

```







## 2.生成树协议STP

全称：Spanning Tree Protocol

作用：提高网络的可靠性（健壮性）的同时又避免了环路带来的各种问题。

- 消除二层环路：通过<font color = 'red'>**阻断冗余链路**</font>来消除交换网络中可能存在的环路。
- 链路备份：当<font color = 'red'>**活动链路发生故障时**</font>，**重新激活冗余链路**，即时恢复网络连通性。



核心：生成树算法STA（Spanning Tree Algorithm）

​			其目标是在包含有物理环路的网络中，构建出一个能连通全网各个节点的树形无环逻辑拓扑。

<img src="入职培训.assets/image-20240710211335847.png" alt="image-20240710211335847" style="zoom:50%;" />



有环路就会发生：

- 广播风暴。<font color = 'red'>**广播帧会被洪泛到所有端口**</font>，导致交换机超负荷运载，耗尽端口带宽，阻塞全网信息。

<img src="入职培训.assets/image-20240710212110254.png" alt="image-20240710212110254" style="zoom: 33%;" />

- 多帧复制。<font color = 'red'>**单播帧会被复制多份发送给目的终端**</font>

<img src="入职培训.assets/image-20240710212759982.png" alt="image-20240710212759982" style="zoom:33%;" />

- mac地址表震荡。<font color = 'red'>**相同帧从交换机的不同接口学习，导致mac地址。**</font>

<img src="入职培训.assets/image-20240710213106246.png" alt="image-20240710213106246" style="zoom:33%;" />

 



### 工作原理

​		通过<font color = 'red'>**交换机之间交换BPDU消息**</font>来发现环路，并有选择的<font color = 'red'>**阻塞某些端口**</font>，最终将环路网络修剪成无环路的树形网络结构。

> 根网桥发送BPDU报文，非根网桥转发BPDU报文。
>
> `BPDU`报文中携带了STP收敛所需的路径和优先级及信息，STP利用这些信息实现网络拓扑的收敛。



### 基础知识

#### 桥ID

用于在STP中唯一标识网桥（交换机）。

桥ID = 桥优先级（2B）+桥MAC地址（6B）   `优先级默认是32768，范围是0-65536，可修改，4096的倍数`

> 优先级值越小，则越优先。
>
> 网桥ID越小越优先。



#### STP的路径开销

用于衡量路径的优劣。路径的开销<font color = 'red'>**与链路带宽成反比**</font>。

**跟路径开销：**到达根桥的路径开销

<img src="入职培训.assets/截屏2024-07-11 21.23.07.png" alt="截屏2024-07-11 21.23.07" style="zoom: 67%;" />

#### 端口ID

用于唯一标识网桥中的某一端口。

端口ID = 端口优先级（1B） + 端口号（1B）

> 端口优先级：0~240，16的倍数，默认是128
>
> 端口号越小，越优先。



### STP工作过程

1. 选举一个<font color = 'red'>**根网桥**</font>     `桥ID最小（①交换机的优先级（越小）②mac地址越小）`
2. 在**每个非根网桥**上选出一个<font color = 'red'>**根端口**</font>     `①端口到根的路径开销最小 ②发送（对端）桥ID最小 ③发送端口ID最小` ④接收端ID最小
3. 在**每条链路**上选出一个<font color = 'red'>**指定端口**</font>   `①网桥到根的路径开销最小 ②本端网桥ID最小 ③发送端口ID最小 `
4. 剩下的为<font color = 'red'>**阻塞端口**</font>

<img src="入职培训.assets/截屏2024-07-11 21.41.56.png" alt="截屏2024-07-11 21.41.56" style="zoom:50%;" />

<img src="入职培训.assets/截屏2024-07-11 21.53.01.png" alt="截屏2024-07-11 21.53.01" style="zoom:50%;" />



### 单端口环路检测

#### 单端口成环

> SW1开启了生成树后能够检测到G0/1下存在环路吗？

单端口环路生成树无法通过阻塞端口来解除环路。因为设备SW1的G0/1收到自己发出的bpdu报文，无法比较与SW2的优先级。

<img src="../Library/Application Support/typora-user-images/截屏2024-07-11 21.56.03.png" alt="截屏2024-07-11 21.56.03" style="zoom:50%;" />

#### 环路检测

#### keepalive

开启keepalive功能的端口会<font color = 'red'>**定期发送loopback检测报文**</font>，当接口发出后又收到，则会<font color = 'red'>**主动shutdown接口**</font>
优点：能够快速关闭存在环路的接口，避免设备cpu资源被耗尽。
缺点：**环路解除后不能自动恢复接口**，需要执行no shutdown命令才能恢复。



### 生成树配置命令

```cmd
# 启用关闭生成树（交换机默认开启）
Switch_config#no spanning-tree 
Switch_config#spanning-tree  # 开启
# 生成树状态查看
Switch_config#show spanning-tree (detail)


# 修改生成树的协议的类型
Switch_config#spanning-tree mode {rstp、stp、mstp}
# 设置网桥优先级（一般将核心交换机设置为根网桥）
Switch_config#spanning-tree rstp priority bridge-priority
# 为接口配置优先级（一般不用改动）
Switch_config_f0/6#spanning-tree rstp port-priority port-priority
```



### 实验

<img src="入职培训.assets/image-20240711221045934.png" alt="image-20240711221045934" style="zoom: 33%;" />

- PC2连接到SW2上

  - 设置其为根网桥（优先级设为最小）

  ```cmd
  Sw2_config#spanning-tree mode rstp
  Sw2_config#spanning-tree rstp priority 2
  ```

  - 将G0/1、G0/2接口设置为trunk模式

  ```cmd
  Sw2_config#int g0/1
  Sw2_config_g0/1#switchport mode trunk
  Sw2_config#int g0/2
  Sw2_config_g0/2#switchport mode trunk
  ```

- PC1连接到SW1上

  - 设置G0/1、G0/2为trunk模式

  ```cmd
  Sw1_config#int g0/1
  Sw1_config_g0/1#switchport mode trunk
  Sw1_config#int g0/2
  Sw1_config_g0/2#switchport mode trunk
  ```

- PC1连接到SW3上

  ```cmd
  Sw3_config#int g0/1
  Sw3_config_g0/1#switchport mode trunk
  Sw3_config#int g0/2
  Sw3_config_g0/2#switchport mode trunk
  ```



# Day04



![221720680193_.pic](入职培训.assets/221720680193_.pic.jpg)

1. 为sw1、sw2、sw3(二层)分别创建vlan10、vlan20，并分别为vlan10、vlan20分配真实ip地

```cmd
sw1_config#vlan 10,20
sw1_config#int vlan 10
sw1_config_v10#ip address 192.168.10.1 255.255.255.0 # 为Vlan 10设置真实的ip地址

# ---------------
#若报错%err: IP network 192.168.10.0 overlaps with VLAN1
sw1_config_v10#exit
sw1_config#no int vlan 1
sw1_config#int vlan 1
sw1_config_v1#exit
sw1_config#int vlan 10
sw1_config_v10#ip address 192.168.10.1 255.255.255.0 # 为Vlan 10设置真实的ip地址
sw1_config_v10#exit
sw1_config#int vlan 1
sw1_config_v1#ip address 192.168.0.1 255.255.255.0 # 为Vlan 1设置真实的ip地址
# ---------------

sw1_config_v10#exit
sw1_config#int vlan 20
sw1_config_v20#ip address 192.168.20.1 255.255.255.0 # 为Vlan 10设置真实的ip地址
sw1_config_v20#exit
sw1_config#show ip int b
Interface                  IP-Address      Method Protocol-Status 
Null0                      unassigned      manual up  
VLAN10                     192.168.10.1    manual down
VLAN1                      192.168.0.1     manual up  
VLAN20                     192.168.20.1    manual down


# 为sw2执行相似操作
sw2_config#show ip int b
Interface                  IP-Address      Method Protocol-Status 
Null0                      unassigned      manual up  
VLAN1                      192.168.0.2     manual up  
VLAN20                     192.168.20.2    manual down
VLAN10                     192.168.10.2    manual down

# sw3
sw3_config#int vlan 1
sw3_config_v1#ip add 192.168.0.3 255.255.255.0
```



2. 为sw1和sw2开启mstp模式

```cmd
sw1_config#spanning-tree mode mstp 
sw1_config#spanning-tree mstp name 123
sw1_config#spanning-tree mstp revision 1
sw1_config#spanning-tree mstp instance 1 vlan 10
sw1_config#spanning-tree mstp instance 2 vlan 20
sw1_config#spanning-tree mstp 1 priority 4096

sw1_config#show int b
Port   Description    Status    Vlan        Duplex   Speed    Type
g0/1                  down      1           auto     auto     Giga-Combo-FX    
g0/2                  up        1           full     1000Mb   Giga-Combo-TX    
g0/3                  down      1           auto     auto     Giga-Combo-FX    
g0/4                  up        1           full     100Mb    Giga-Combo-TX    
g0/5                  down      1           auto     auto     Giga-TX          
g0/6                  down      1           auto     auto     Giga-TX          
g0/7                  down      1           auto     auto     Giga-TX          
g0/8                  down      1           auto     auto     Giga-TX          
g0/9                  down      1           auto     auto     Giga-TX          
g0/10                 down      1           auto     auto     Giga-TX          
g0/11                 down      1           auto     auto     Giga-TX          
g0/12                 down      1           auto     auto     Giga-TX          
g0/13                 down      1           auto     auto     Giga-TX          
g0/14                 down      1           auto     auto     Giga-TX          
g0/15                 down      1           auto     auto     Giga-TX          
g0/16                 down      1           auto     auto     Giga-TX          
g0/17                 down      1           auto     auto     Giga-TX          
g0/18                 down      1           auto     auto     Giga-TX          
g0/19                 down      1           auto     auto     Giga-TX          
g0/20                 down      1           auto     auto     Giga-TX          
g0/21                 down      1           auto     auto     Giga-TX          
g0/22                 down      1           auto     auto     Giga-TX          

SW1_config#show spanning-tree 
Spanning tree enabled protocol RSTP(2004)

RSTP
  Root ID    Priority    32768
             Address     00E0.0F62.9CB9
             This bridge is the root
             Hello Time 2 sec  Max Age 20 sec  Forward Delay 15 sec

  Bridge ID  Priority    32768
             Address     00E0.0F62.9CB9
             Hello Time 2 sec  Max Age 20 sec  Forward Delay 15 sec

Interface        Role Sts Cost      Pri.Nbr  Type
---------------- ---- --- --------- -------- -----------------------
g0/2             Desg FWD 20000     128.10   P2p
g0/4             Desg FWD 200000    128.12   P2p

SW1_config#int g0/2
SW1_config_g0/2#switchport mode trunk 
SW1_config_g0/2#int g0/4
SW1_config_g0/4#switchport mode trunk


# --------------------------------------
SW2_config#spanning-tree mode mstp 
SW2_config#spanning-tree mstp name 123
SW2_config#spanning-tree mstp revision 1
SW2_config#spanning-tree mstp instance 1 vlan 10
SW2_config#spanning-tree mstp instance 2 vlan 20
SW2_config#spanning-tree mstp 2 priority 4096
SW2_config#show spanning-tree 

Spanning tree enabled protocol MSTP

MST00
  Root ID    Priority    32768
             Address     00E0.0F62.9CB9
             Port        GigaEthernet0/6
             Cost        20000
             Hello Time 2 sec  Max Age 20 sec  Forward Delay 15 sec

  Bridge ID  Priority    32768  (priority 32768 mst-id 0)
             Address     FCFA.F7C0.EDE1
             Hello Time 2 sec  Max Age 20 sec  Forward Delay 15 sec

Interface        Role Sts Cost      Pri.Nbr  Type
---------------- ---- --- --------- -------- -----------------------
g0/6             Root FWD 20000     128.14   P2p Bound(RSTP)
g0/8             Desg FWD 200000    128.16   P2p Bound(RSTP)

SW2_config#int g0/6
SW2_config_g0/6#switchport mode trunk
SW2_config#int g0/8
SW2_config_g0/8#switchport mode trunk
SW2_config#show spanning-tree 

Spanning tree enabled protocol MSTP

MST00
  Root ID    Priority    32768
             Address     00E0.0F62.9CB9
             Port        GigaEthernet0/6
             Cost        20000
             Hello Time 2 sec  Max Age 20 sec  Forward Delay 15 sec

  Bridge ID  Priority    32768  (priority 32768 mst-id 0)
             Address     FCFA.F7C0.EDE1
             Hello Time 2 sec  Max Age 20 sec  Forward Delay 15 sec

Interface        Role Sts Cost      Pri.Nbr  Type
---------------- ---- --- --------- -------- -----------------------
g0/6             Root FWD 20000     128.14   P2p Bound(RSTP)
g0/8             Desg FWD 200000    128.16   P2p Bound(RSTP)

MST01
  Root ID    Priority    32769
             Address     FCFA.F7C0.EDE1
             This bridge is the root
          
  Bridge ID  Priority    32769  (priority 32768 mst-id 1)
             Address     FCFA.F7C0.EDE1

Interface        Role Sts Cost      Pri.Nbr  Type
---------------- ---- --- --------- -------- -----------------------
g0/6             Mast FWD 20000     128.14   P2p Bound(RSTP)
g0/8             Boun FWD 200000    128.16   P2p Bound(RSTP)

MST02
  Root ID    Priority    4098
             Address     FCFA.F7C0.EDE1
             This bridge is the root

  Bridge ID  Priority    4098  (priority 4096 mst-id 2)
             Address     FCFA.F7C0.EDE1

Interface        Role Sts Cost      Pri.Nbr  Type
---------------- ---- --- --------- -------- -----------------------
g0/6             Mast FWD 20000     128.14   P2p Bound(RSTP)
g0/8             Boun FWD 200000    128.16   P2p Bound(RSTP)




# -------------------
SW2_config#spanning-tree mode mstp 
SW3_config#spanning-tree mstp name 123
SW3_config#spanning-tree mstp revision 1
SW3_config#spanning-tree mstp instance 1 vlan 10
SW3_config#spanning-tree mstp instance 2 vlan 20

SW3_config#vlan 10,20

SW3#show spanning-tree 

Spanning tree enabled protocol MSTP

MST00
  Root ID    Priority    32768
             Address     00E0.0F62.9CB9
             Port        FastEthernet0/16
             Cost        20000
             Hello Time 2 sec  Max Age 20 sec  Forward Delay 15 sec

  Bridge ID  Priority    32768  (priority 32768 mst-id 0)
             Address     8479.7367.410D
             Hello Time 2 sec  Max Age 20 sec  Forward Delay 15 sec

Interface        Role Sts Cost      Pri.Nbr  Type
---------------- ---- --- --------- -------- -----------------------
f0/15            Altn BLK 200000    128.19   P2p Bound(RSTP)
f0/16            Root FWD 200000    128.20   P2p

SW3_config#int range f0/15-16
SW3_config_if_range#switchport mode trunk 
SW3_config#show spanning-tree 

Spanning tree enabled protocol MSTP

MST00
  Root ID    Priority    32768
             Address     00E0.0F62.9CB9
             Port        FastEthernet0/16
             Cost        20000
             Hello Time 2 sec  Max Age 20 sec  Forward Delay 15 sec

  Bridge ID  Priority    32768  (priority 32768 mst-id 0)
             Address     8479.7367.410D
             Hello Time 2 sec  Max Age 20 sec  Forward Delay 15 sec

Interface        Role Sts Cost      Pri.Nbr  Type
---------------- ---- --- --------- -------- -----------------------
f0/15            Altn BLK 200000    128.19   P2p Bound(RSTP)
f0/16            Root FWD 200000    128.20   P2p

MST01
  Root ID    Priority    32769
             Address     8479.7367.410D
             This bridge is the root
          
  Bridge ID  Priority    32769  (priority 32768 mst-id 1)
             Address     8479.7367.410D

Interface        Role Sts Cost      Pri.Nbr  Type
---------------- ---- --- --------- -------- -----------------------
f0/15            Altn BLK 200000    128.19   P2p Bound(RSTP)
f0/16            Desg FWD 200000    128.20   P2p

MST02
  Root ID    Priority    4098
             Address     FCFA.F7C0.EDE1
             Port        FastEthernet0/16
             Cost        200000

  Bridge ID  Priority    32770  (priority 32768 mst-id 2)
             Address     8479.7367.410D

Interface        Role Sts Cost      Pri.Nbr  Type
---------------- ---- --- --------- -------- -----------------------
f0/15            Altn BLK 200000    128.19   P2p Bound(RSTP)
f0/16            Root FWD 200000    128.20   P2p


==============================
SW3_config#show run
...
interface VLAN1
 ip address 192.168.0.3 255.255.255.0
 no ip directed-broadcast
...

SW1_config#show run
# ...
interface VLAN1
 ip address 192.168.0.1 255.255.255.0
 no ip directed-broadcast
!
interface VLAN10
 ip address 192.168.10.1 255.255.255.0
 no ip directed-broadcast
!
interface VLAN20
 ip address 192.168.20.1 255.255.255.0
 no ip directed-broadcast
...

```



```
SW1_config#int vlan 10
SW1_config_v10#vrrp 1 associate 192.168.10.254 255.255.255.0
SW1_config_v10#vrrp 1 priority 120

SW2_config#int vlan 10 
SW2_config_v10#vrrp 1 associate 192.168.10.254 255.255.255.0

SW2#show vrrp brief 
Interface Grp Prio Pree State    Master addr       Virtual addr
v10       1   100   Y   BACKUP   192.168.10.1      192.168.10.254

SW1#show vrrp brief 
Interface Grp Prio Pree State    Master addr       Virtual addr
v10       1   120   Y   Master   192.168.10.1      192.168.10.254

SW1_config#int vlan 20
SW1_config_v20#vrrp 2 associate 192.168.20.254 255.255.255.0

SW2_config#int vlan 20
SW2_config_v20#vrrp 2 associate 192.168.20.254 255.255.255.0
SW2_config_v20#vrrp 2 priority 120

SW2#show vrrp brief 
Interface Grp Prio Pree State    Master addr       Virtual addr
v20       2   120   Y   Master   192.168.20.2      192.168.20.254
v10       1   100   Y   BACKUP   192.168.10.1      192.168.10.254

SW1#show vrrp brief 
Interface Grp Prio Pree State    Master addr       Virtual addr
v10       1   120   Y   Master   192.168.10.1      192.168.10.254
v20       2   100   Y   BACKUP   192.168.20.2      192.168.20.254
```





# Day05

## 1、路由技术

### 路由器概念

路由器：**将用户数据从一个子网转发到另一个子网。**

位置处于局域网边缘与运营商对接。



<font color = 'red'>**网路通信是双向通信**</font>

### 路由器分类

![截屏2024-07-13 09.47.25](入职培训.assets/截屏2024-07-13 09.47.25.png)

### 路由器工作原理

#### 路由表

是路由器中的全局路由表，在config中进行查看

```cmd
Router_config#show ip route
```

##### 常见优先级

```text
直连  0
静态  60
OSPF 10   150
ISIS 15
RIP  100
BGP  255
```



##### 路由类型

###### 静态路由S

手动配置

```cmd
# 网络规划这根据网络拓扑、使用命令在路由器上配置路由信息
Router_config#ip route 192.168.0.0 255.255.0.0 192.168.120.254
```



###### 直连路由C

直连网段生成

在设备上创建三层接口即可形成

```cmd
Router_config#interface gigaEthernet 0/1
Router_config_g0/1#ip add 192.168.120.20 255.255.255.0
```



###### 动态路由O

根据OSPF协议生成的动态路由

路由器按照特定的算法自动计算路由信息、能够适应网络拓扑的变化，路由协议有OSPF/RIP/BGP等



##### 目标网段

俗称路由，<font color = 'red'>**由网络号加掩码组成**</font>。

当Ip地址和网络号匹配则命中路由 `0.0.0.0/0 缺省路由（网关、默认路由）`

<img src="入职培训.assets/截屏2024-07-13 09.52.08.png" alt="截屏2024-07-13 09.52.08" style="zoom: 67%;" />



##### 出接口/下一跳

被匹配的数据从哪个端口转发，该端口的类型决定了数据包二层封装的协议格式



##### 路由表添加路由原理

```cmd
# 路由表中有192.168.120.0/24的直连路由，再添加一条192.168.120.0/24的静态路由，此时路由表中会有两条相同路# 由，还是只会出现一条，如果是一条路由则选择哪一条为什么？

选择添加直连路由
```

###### 管理距离

**不同类型路由之间的优先级。**

代表路由信息的可靠性，不同路由协议通过<font color = 'red'>**比较管理距离**</font>选择路由。

<font color = 'red'>**直连路由>静态路由>动态路由**</font>



###### 开销

**同类路由之间的优先级。**

从源到目的地经过的所有链路的开销总和（下一跳次数），相同路由协议比较开销选择路由。

开销小的路由优于开销大的路由



##### 路由表查找原则

###### 最长掩码匹配原则

路由器收到一个数据包，在查找路由表时，如果目的IP匹配多个路由条目，则掩码长者优先

```
# 目的IP192.168.3.1的数据包从哪个端口转发？
```

<img src="入职培训.assets/截屏2024-07-13 10.04.41.png" alt="截屏2024-07-13 10.04.41" style="zoom:50%;" />



##### 常见路由功能

###### 负载均衡

###### 浮动路由

```cmd
# 优先级高，主用路由，加入到路由表
# 优先级低，备用路由，不加入路由表
ip route default GigaEthernet0/0       # 值越小，优先级越高
ip route default GigaEthernet0/1 5
```

> 主链路正常时的路由表

<img src="入职培训.assets/image-20240713101458113.png" alt="image-20240713101458113" style="zoom:50%;" />

> 主链路异常，备份路由变为主用路由，加入到路由表中

<img src="入职培训.assets/image-20240713101541541.png" alt="image-20240713101541541" style="zoom:50%;" />







###### PBR

Policy-based-route：基于策略的路由，根据用户制定的策略进行路由选择的机制。

基于**源IP、协议、端口号、长度**等参数对数据进行分类，对分类的数据执行转发策略。
从特定的出口转发数据或者设置数据的优先级。

<img src="入职培训.assets/image-20240713101912152.png" alt="image-20240713101912152" style="zoom:50%;" />

```
# 怎样实现BOSS上网不经过行为管理，而员工上网流量需要经过行为管理 ？

# BOSS使用静态IP地址192.168.20.252/24
# DHCP地址池中不包括网关和192.168.20.252/24
# 员工使用DHCP到的地址 192.168.20.0/24
```

<img src="入职培训.assets/image-20240713102006107.png" alt="image-20240713102006107" style="zoom:50%;" />

```cmd
# 第一步，分析数据流，用ACL将数据流从众多的数据包中挑出来。
ip access-list extended pbr
permit ip 192.168.20.252 255.255.255.255 any sequence 10

# 第二步，配置route-map路由图。
route-map pbr 2 permit
match ip address pbr
set ip next-hop 10.1.1.1 

# 第三步，将route-map绑定到数据流的入接口。
interface GigaEthernet0/5
ip policy route-map pbr
```



## 2. 访问控制列表

### ACL概念

访问控制列表（Access Control List）简称ACL——网络资源所提供的<font color = 'red'>**一种访问控制技术**</font>。

控制动作：是否能到达目标，对带宽资源保障/限制，出口选择......



```cmd
# 设备中的ACL
ip access-list extended ip-acl
Permit tcp 10.1.0.0 255.255.255.0  10.1.2.20 255.255.255.0 eq 80
permit tcp 10.1.1.1 255.255.255.255 eq 21 any eq 21
Deny tcp 10.1.1.0  255.255.255.0   10.1.2.21 255.255.255.255 eq 1521
permit ip src_range 10.1.1.2 10.1.1.50 any
permit ip  10.1.1.1 255.255.255.0 dst_range 10.2.1.1 10.2.1.250
Deny ip 10.1.0.0 0.0.255.255 any
deny any any //默认有但不显示

mac access-list mac-acl
permit host 1234.5678.abcd any 0x806
deny any any //默认有但不显示
```



### ACL种类及配置

##### IP ACL

基于IP进行控制的ACL
IP ACL分类：标准ACl，扩展Acl
<font color = 'red'>**用在路由器/三层交换机上**</font>



##### **MAC ACL**

基于mac进行控制的ACL
<font color = 'red'>**用在交换机上**</font>

<font color = 'red'>**无分类，作用在二层接口 in 方向**</font>

关心mac地址及以太网类型

##### 设置ACL步骤

规则：

```
1. 同一网段用mac 不同网段用ip
2. 选用标准or扩展
	 标准：只匹配源ip
   扩展：匹配源目ip,源目端口
3. 识别源目为：网段/单个终端/应用/不确定的源或目标
4. permit 允许 deny   拒绝
```



###### 1.形成ACL列表

###### 2.应用ACL

###### 3.模拟验证

<img src="入职培训.assets/截屏2024-07-13 10.33.20.png" alt="截屏2024-07-13 10.33.20" style="zoom:50%;" />

```cmd
# 采用ip acl实现从192.168.1.0网段到192.168.2.0网段的业务不允许通过
# 采用ip acl实现从192.168.2.0网段到192.168.1.0网段的业务不允许通过

# 选用IP ACL，标准方案
ip access-list standard acl1
Deny 192.168.1.0 255.255.255.0
Permit any
Int g0/1  # 应用在g0/1端口
ip access-group acl1 in # 入口

# 第二种方法， 由于通信是双向的
ip access-list standard acl2
Deny 192.168.2.0 255.255.255.0
Permit any
Int g0/1  # 应用在g0/1端口
ip access-group acl2 out # 出口



# 扩展方式
ip access-list extended acl3
Deny  ip 192.168.1.0 255.255.255.0 192.168.2.0 255.255.255.0
Permit ip any any
Int g0/1  
ip access-group acl3 in

ip access-list standard acl4
Deny  192.168.2.0 255.255.255.0  192.168.1.0 255.255.255.0
Permit ip any any
Int  g0/1
ip access-group acl4 out
```

<img src="入职培训.assets/截屏2024-07-13 10.36.55.png" alt="截屏2024-07-13 10.36.55" style="zoom:50%;" />

```
需求翻译：
采用ip acl实现从192.168.1.0网段到192.168.2.0网段的业务不允许通过
                       实现从192.168.1.100到192.168.2.0网段的业务允许通过
                       实现从所有网段到公网的业务都允许通过
```

```
# 扩展方式
ip access-list extended acl1
Permit  ip 192.168.1.100 255.255.255.255 192.168.2.0 255.255.255.0
Deny  ip 192.168.1.0 255.255.255.0   192.168.2.0 255.255.255.0
Permit ip any any
Int g0/1  
ip access-group acl1 in
```

```
ip access-list extended acl2
Permit ip 192.168.2.0 255.255.255.255 192.168.1.100 255.255.255.255
Deny ip 192.168.2.0 255.255.255.0 192.168.1.0 255.255.255.0
Permit ip any any
Int g0/2
ip access-group acl2 in
```



<img src="入职培训.assets/截屏2024-07-13 10.41.29.png" alt="截屏2024-07-13 10.41.29" style="zoom:50%;" />

```cmd
ip access-list extended acl1
Deny  ip 192.168.1.0 255.255.255.255 192.168.2.0 255.255.255.0 web应用
Permit ip any any
Int g0/1  
ip access-group acl1 in

# 限制财务部不能上网
ip access-list extended acl2
Permit ip 192.168.3.2 255.255.255.255 192.168.2.0 255.255.255.0
Deny  ip 192.168.1.0 255.255.255.255 192.168.2.0 255.255.255.0 eq 80
Permit  ip 192.168.1.0 255.255.255.255 192.168.2.0 255.255.255.0
Deny ip any any
Int g0/2
ip access-group acl1 out
```













总结

1. 常用测试工具

   Ping、路由跟踪、查看arp表、查看终端网卡地址（ipconfig）、远程登录telnet、查看路由表

2. 



3. 网络通信基础

   交换机工作原理：1、学习源mac， 根据目的MAC地址

6. vrrp

   选举原则：优先级（越大越优先）、接口ip（越大越优先）

   Track：跟踪上联端口，如果跟踪的端口down了，设备接口的vrrp优先级下降

   抢占功能：主设备优先级降低以后，备设备能主动去抢占vrrp主，来实现业务的迁移（跟踪上联端口功能一起使用）

   







